# Room Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoomTag..::..Room Property
RoomTag Class See Also
---
The room that the tag is associated with.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Room Room { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Room As Room
	Get
```

Visual C++
---
```text
public:
property Room^ Room {
	Room^ get ();
}
```

# Remarks
In rare cases, the tag may not be associated to a room. The property will be nullNothingnullptra null reference (Nothing in Visual Basic) in these situations.
# See Also
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace